Tekla.Structures.ModelInternal.Operation.ExportIFCFromAll(System.String,System.String,Tekla.Structures.Model.Operations.Operation.IFCExportViewTypeEnum,Tekla.Structures.Model.Operations.Operation.IFCExportVersionEnum,System.Collections.Generic.List{System.String},Tekla.Structures.Model.Operations.Operation.ExportBasePoint,System.String,System.String,Tekla.Structures.Model.Operations.Operation.IFCExportFlags,System.Boolean,System.Boolean,System.String)
IFC export from all objects
ModelName:  The name of the model in the export file.
FullFileName:  The name of the export file with file path.
ViewType:  Configuration view type of the export.
Version:  IFC version of the export.
PropertySets:  List of property sets to be exported.
BasePoint: Defines which base point is used in export.
ExportLayersAs: Defines which report field to use for layers export.
ObjectColoring: Defines which object coloring filter is to be used in export.
Flags: Boolean flags for IFC 4 export.
UseTimer:  Export with timer information.
CreateReport:  Create report from export.
BasePointGuid: Base point guid if BasePoint parameter is set to BASE_POINT.
Returns:
Returns false if the export fails for some reason

Tekla.Structures.ModelInternal.Operation.ConvertReferenceModels
Converts Reference models as TS native objects.

Tekla.Structures.ModelInternal.Operation.CreateExportObjectList(System.String,System.Boolean,Tekla.Structures.ModelInternal.dotExportSelectionInfo_t)
Converts Reference models as TS native objects.

Tekla.Structures.ModelInternal.Operation.ExportIFCFromSelected(System.String,System.String,Tekla.Structures.Model.Operations.Operation.IFCExportViewTypeEnum,Tekla.Structures.Model.Operations.Operation.IFCExportVersionEnum,System.Collections.Generic.List{System.String},Tekla.Structures.Model.Operations.Operation.ExportBasePoint,System.String,System.String,Tekla.Structures.Model.Operations.Operation.IFCExportFlags,System.Boolean,System.Boolean,System.String)
IFC export from selected objects
ModelName:  The name of the model in the export file.
FullFileName:  The name of the export file with file path.
ViewType:  Configuration view type of the export.
Version:  IFC version of the export.
PropertySets:  List of property sets to be exported.
BasePoint: Defines which base point is used in export.
ExportLayersAs: Defines which report field to use for layers export.
ObjectColoring: Defines which object coloring filter is to be used in export.
Flags: Boolean flags for IFC 4 export.
UseTimer:  Export with timer information.
CreateReport:  Create report from export.
BasePointGuid: Base point guid if BasePoint parameter is set to BASE_POINT.
Returns:
Returns false if the export fails for some reason

Tekla.Structures.ModelInternal.Operation.ExportIFCFromObjects(System.String,System.String,Tekla.Structures.Model.Operations.Operation.IFCExportViewTypeEnum,Tekla.Structures.Model.Operations.Operation.IFCExportVersionEnum,System.Collections.Generic.List{System.String},System.Collections.Generic.List{Tekla.Structures.Model.ModelObject},Tekla.Structures.Model.Operations.Operation.ExportBasePoint,System.String,System.String,Tekla.Structures.Model.Operations.Operation.IFCExportFlags,System.Boolean,System.Boolean,System.String)
IFC export from given objects
ModelName:  The name of the model in the export file.
FullFileName:  The name of the export file with file path.
ViewType:  Configuration view type of the export.
Version:  IFC version of the export.
PropertySets:  List of property sets to be exported.
BasePoint: Defines which base point is used in export.
ModelObjects:  List of model objects to export.
ExportLayersAs: Defines which report field to use for layers export.
ObjectColoring: Defines which object coloring filter is to be used in export.
Flags: Boolean flags for IFC 4 export.
UseTimer:  Export with timer information.
CreateReport:  Create report from export.
BasePointGuid: Base point guid if BasePoint parameter is set to BASE_POINT.
Returns:
Returns false if the export fails for some reason

Tekla.Structures.ModelInternal.Operation.ExportIFCFromFilteredObjects(System.String,System.String,Tekla.Structures.Model.Operations.Operation.IFCExportViewTypeEnum,Tekla.Structures.Model.Operations.Operation.IFCExportVersionEnum,System.Collections.Generic.List{System.String},System.String,Tekla.Structures.Model.Operations.Operation.ExportBasePoint,System.String,System.String,Tekla.Structures.Model.Operations.Operation.IFCExportFlags,System.Boolean,System.Boolean,System.String)
IFC export from filtered objects
ModelName:  The name of the model in the export file.
FullFileName:  The name of the export file with file path.
ViewType:  Configuration view type of the export.
Version:  IFC version of the export.
PropertySets:  List of property sets to be exported.
FilterName:  Filter file name for model objects to export.
BasePoint: Defines which base point is used in export.
ExportLayersAs: Defines which report field to use for layers export.
ObjectColoring: Defines which object coloring filter is to be used in export.
Flags: Boolean flags for IFC 4 export.
UseTimer:  Export with timer information.
CreateReport:  Create report from export.
BasePointGuid: Base point guid if BasePoint parameter is set to BASE_POINT.
Returns:
Returns false if the export fails for some reason

Tekla.Structures.ModelInternal.Operation.ExportIFC(System.String,System.String,Tekla.Structures.Model.Operations.Operation.IFCExportViewTypeEnum,Tekla.Structures.Model.Operations.Operation.IFCExportVersionEnum,System.Collections.Generic.List{System.String},System.String,System.Boolean,Tekla.Structures.Model.Operations.Operation.ExportBasePoint,System.String,System.String,Tekla.Structures.Model.Operations.Operation.IFCExportFlags,System.Boolean,System.Boolean,System.String)


Tekla.Structures.ModelInternal.Operation.StartLiveSharing(Tekla.Structures.Model.Internal.LiveSharingChangeSetDelegate,Tekla.Structures.Model.Internal.LiveSharingModelType)
Start LiveSharing and return changesets via callback
callback:
modelType:
Returns: True if successful

Tekla.Structures.ModelInternal.Operation.StopLiveSharing(Tekla.Structures.Model.Internal.LiveSharingModelType)
Stop LiveSharing
Returns:

Tekla.Structures.ModelInternal.Operation.CreateBaseline(System.String,Tekla.Structures.Model.Internal.LiveSharingModelType,Tekla.Structures.Model.Internal.CancellableProgressReportDelegate)
Create a new baseline
trimbimFilePath:
modelType:
progressCb: Callback to update the progress and get cancelation notification.
Returns: true if the baseline is created, false otherwise

Tekla.Structures.ModelInternal.Operation.GetPendingChangeSets(System.String,Tekla.Structures.Model.Internal.LiveSharingModelType)
Gets the initial change set that includes all changes prior joining a session
eventName:
modelType:
Returns: the initial change set

Tekla.Structures.ModelInternal.Operation.GetNormalizedPlateProfileName(System.Int32,System.Int32,System.String@)
Gets parts normalized plate profile name (PL20X10 -> PL10X20).
objectId: The parts id.
numOfDimensions: Number of dimension in the normalized plate proifle name (PL10, PL10X20)
profile: return value, normalized plate profile name
Returns: true if successful (part was plate)